There are two different types of Data structures in Pandas : Series and data frames.

# Series

A Series looks like a column and is very similar to a one dimensional NumPy array

In [ ]:
# imporat numpy and pandas
import
import

## Creating a Series

Series Can be Created from converting :
    * Lists
    * Dictionaries
    * NumPy Arrays
    
#### 1- Creating a Pandas Series from Lists    

##### Method #1

Using Series() method without index argument:

In [ ]:
my_list = [10, 20, 30, 40]

s1 =pd.

s1

0    10
1    20
2    30
3    40
dtype: int64

##### Method #2

Using Series() method with index argument:

In [ ]:
label = ['a', 'b', 'c', 'd']

s1 =pd.
s1

a    10
b    20
c    30
d    40
dtype: int64

##### Method #3

Using Series() method with multi-list

In [ ]:
multi_list=[['Hannes'],['thomas'],['Peter'],['Rashid']]

s=pd.Series(i[0] for i in multi_list)
s

0    Hannes
1    thomas
2     Peter
3    Rashid
dtype: object

#### 2- Creating a Pandas Series from  Dictionaries

##### Method #1

In [ ]:
d = {'Egypt' : 'Cairo', 'France' : 'Paris', 'Italy' : 'Rome'}
s2 = pd.Series(d)
s2

Egypt     Cairo
France    Paris
Itly       Rome
dtype: object

#####  Method #2

In [ ]:
pd.Series(data = d, index = ['Egypt','France','Italy'])

Egypt     Cairo
France    Paris
Itly       Rome
dtype: object

In [ ]:
pd.Series(data = d, index =['Egypt','France','Italy','H'] )

Egypt     Cairo
France    Paris
Itly       Rome
H           NaN
dtype: object

In [ ]:

pd.Series(data = d, index=['E','F','I'] )

E    NaN
F    NaN
I    NaN
dtype: object

#### 3- Creating a Pandas Series from Numpy array:

##### Method#1 using linspace

In [ ]:
import numpy as np
v=np.linspace(1,2,3)
series1=pd.Series(v,index=['A','B','C'])
series1

A    1.0
B    1.5
C    2.0
dtype: float64

##### Method#2 using np.random.rand() method

In [ ]:
series2=pd.Series(?,index=['A','B','C'])
series2

A    0.043397
B    0.223937
C    0.575205
dtype: float64

In [ ]:

a = np.array([100, 200, 300, 400])
s3 = pd.Series(a)
print(s3)

s4 = pd.Series(a, index=label)
s4

0    100
1    200
2    300
3    400
dtype: int32

a    100
b    200
c    300
d    400
dtype: int32

## Data in a Series

In [ ]:
pd.Series(data = label)

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

In [ ]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [ ]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [ ]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [ ]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [ ]:
ser1['USA']

1

In [ ]:
ser2[2]

5

## Dataframe

A Pandas DataFrame is a two-dimensional data structure with rows and columns. It is comparable with tables or, two-dimensional arrays in NumPy.

### Creating a Dataframe
There are different ways to create a Pandas DataFrame:

* From lists
* from dictionary
* ...

#### Creating Dataframe from Lists:

    s=pd.DataFrame([data],index=[index])

In [ ]:

s=pd.DataFrame(my_list)
s

    0
0  10
1  20
2  30
3  40

In [ ]:

s=pd.DataFrame(my_list, index=label)
s

    0
a  10
b  20
c  30
d  40

###### using zip() for zip two lists

In [ ]:
my_list2=['Hannes','Peter','Müller','Tim']
zip_1=zip(my_list,my_list2)
print(zip_1)# list of tuples
pd.DataFrame(zip(my_list,my_list2))

    0       1
0  10  Hannes
1  20   Peter
2  30  Müller
3  40     Tim

In [ ]:

s2=pd.DataFrame(zip(my_list,my_list2),index=label)
s2

    0       1
a  10  Hannes
b  20   Peter
c  30  Müller
d  40     Tim

In [ ]:
multu_list2=[['Hannes',20],['thomas',30],['Peter',40]]
s_m=pd.DataFrame(multu_list2,?)
s_m

     Name  Age
0  Hannes   20
1  thomas   30
2   Peter   40

In [ ]:

name=['H','m','N']

age=[2,3,5]

country=['E','F','I']

dic={'Name':name,'Age':age,'Coun':country}

dict_data=pd.DataFrame(dic)
dict_data

  Name  Age Coun
0    H    2    E
1    m    3    F
2    N    5    I

In [ ]:
from numpy.random import randn

np.random.seed(10)

In [ ]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [ ]:
df

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [ ]:


df1 = pd.DataFrame(randn(5,4),index=['A','B','C','D','E'], columns=['W','X','Y','Z'])
df1

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [ ]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.028891  0.196801  0.173261  0.133707
std    1.046212  0.696884  1.089988  0.826724
min   -1.136602 -0.720086 -1.545400 -1.079805
25%   -0.965066 -0.174600  0.228630 -0.008384
50%    0.004291  0.135137  0.265512  0.108549
75%    0.621336  0.715279  0.433026  0.445138
max    1.331587  1.028274  1.484537  1.203037

### Selection and Indexing
There are different ways to make selections:

* using indexing operator []
* using .loc[ ]
* using .iloc[ ]


 #### iloc and loc

In [ ]:

df['W']

A    1.331587
B    0.621336
C    0.004291
D   -0.965066
E   -1.136602
Name: W, dtype: float64

### Selecting Rows

######  using .loc[ ]

In [ ]:
# select by row
df.loc['B']

W    0.621336
X   -0.720086
Y    0.265512
Z    0.108549
Name: B, dtype: float64

In [ ]:
df.loc['B','W']

0.6213359738904805

In [ ]:

df.loc[['B']]

          W         X         Y         Z
B  0.621336 -0.720086  0.265512  0.108549

###### using .iloc[ ]

In [ ]:

df.iloc[3]

W   -0.965066
X    1.028274
Y    0.228630
Z    0.445138
Name: D, dtype: float64

In [ ]:
type(df.iloc[3])

pandas.core.series.Series

In [ ]:


df.iloc[3,1]

1.028274077982704

In [ ]:

df.iloc[[3]]

          W         X        Y         Z
D -0.965066  1.028274  0.22863  0.445138

### Selecting subset of rows and columns( Selecting multiple rows)

In [ ]:

df.loc[['A','B']]

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549

in order tow select two rows and two column  by pass them in list to the loc function

In [ ]:

df.loc[['A','B'],['W','X']]

          W         X
A  1.331587  0.715279
B  0.621336 -0.720086

select all the rows[:] and list of columns [ '',''...] using  loc

In [ ]:
df.loc[:,['W']]

          W
A  1.331587
B  0.621336
C  0.004291
D -0.965066
E -1.136602

In [ ]:
# selct two row and two column
df.iloc

          X         Y
C -0.174600  0.433026
D  1.028274  0.228630

you can do the same by .iloc[] function

In [ ]:

df.iloc

          X         Y
A  2.084019 -0.376519
B  1.035125 -0.031160
C -0.741790  0.187125
D  1.482495  0.961458
E  1.192241 -1.046780

DataFrame Columns are just Series

In [ ]:
type(df['W'])

pandas.core.series.Series

In [ ]:
df[['W','Z']]

          W         Z
A  0.386030  0.230336
B  0.681209  1.939932
C -1.005187 -0.732845
D -1.382920 -2.141212
E  0.992573  1.292765

### Conditional Selection
Another commonly used feature in pandas is the conditional selection. It uses brackets and notations and is thus quite similar to NumPy

In [ ]:
df

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

**using greater than operator for filtering of data :**

In [ ]:

df>0

       W      X      Y      Z
A   True   True  False  False
B   True  False   True   True
C   True  False   True   True
D  False   True   True   True
E  False   True   True  False

In [ ]:
df[df>0]

          W         X         Y         Z
A  1.331587  0.715279       NaN       NaN
B  0.621336       NaN  0.265512  0.108549
C  0.004291       NaN  0.433026  1.203037
D       NaN  1.028274  0.228630  0.445138
E       NaN  0.135137  1.484537       NaN

In [ ]:
df[df['W'] > 0]

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037

For two conditions you can use | and & with parenthesis:

In [ ]:
df[(df['W'] > 0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

### Creating a new column:

In [ ]:


df.insert

In [ ]:
df

   new4  new2         W         X         Y         Z      new3
A     1     1  1.331587  0.715279 -1.545400 -0.008384 -0.213814
B     2     2  0.621336 -0.720086  0.265512  0.108549  0.886848
C     3     3  0.004291 -0.174600  0.433026  1.203037  0.437318
D     4     4 -0.965066  1.028274  0.228630  0.445138 -0.736436
E     5     5 -1.136602  0.135137  1.484537 -1.079805  0.347935

In [ ]:

df['new3'] = df['W']+df['Y']

In [ ]:
df

   new4  new2         W         X         Y         Z      new3
A     1     1  1.331587  0.715279 -1.545400 -0.008384 -0.213814
B     2     2  0.621336 -0.720086  0.265512  0.108549  0.886848
C     3     3  0.004291 -0.174600  0.433026  1.203037  0.437318
D     4     4 -0.965066  1.028274  0.228630  0.445138 -0.736436
E     5     5 -1.136602  0.135137  1.484537 -1.079805  0.347935

In [ ]:

col_dic={'ele1':'E1','ele2':'E2','ele3':'E3','ele4':'E4','ele5':'E5'}

df['col_dic']=col_dic
df

   new2         W         X         Y         Z      new3 col_dic
A     1  0.302665  1.693723 -1.706086 -1.159119 -1.403420    ele1
B     2 -0.134841  0.390528  0.166905  0.184502  0.032064    ele2
C     3  0.807706  0.072960  0.638787  0.329646  1.446493    ele3
D     4 -0.497104 -0.754070 -0.943406  0.484752 -1.440510    ele4
E     5 -0.116773  1.901755  0.238127  1.996652  0.121354    ele5

### Removing Columns/Rows using .drop()

In [ ]:
df.drop

   new4         W         X         Y         Z      new3
A     1  1.331587  0.715279 -1.545400 -0.008384 -0.213814
B     2  0.621336 -0.720086  0.265512  0.108549  0.886848
C     3  0.004291 -0.174600  0.433026  1.203037  0.437318
D     4 -0.965066  1.028274  0.228630  0.445138 -0.736436
E     5 -1.136602  0.135137  1.484537 -1.079805  0.347935

In [ ]:

df

   new4  new2         W         X         Y         Z      new3
A     1     1  1.331587  0.715279 -1.545400 -0.008384 -0.213814
B     2     2  0.621336 -0.720086  0.265512  0.108549  0.886848
C     3     3  0.004291 -0.174600  0.433026  1.203037  0.437318
D     4     4 -0.965066  1.028274  0.228630  0.445138 -0.736436
E     5     5 -1.136602  0.135137  1.484537 -1.079805  0.347935

In [ ]:

df.drop()

In [ ]:
df

   new4         W         X         Y         Z      new3
A     1  1.331587  0.715279 -1.545400 -0.008384 -0.213814
B     2  0.621336 -0.720086  0.265512  0.108549  0.886848
C     3  0.004291 -0.174600  0.433026  1.203037  0.437318
D     4 -0.965066  1.028274  0.228630  0.445138 -0.736436
E     5 -1.136602  0.135137  1.484537 -1.079805  0.347935